Рабочая.Задачи2/src/InformationRegisters/ЦБР_ТребуютВнимания/ЦБР_ТребуютВнимания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦБР_ТребуютВнимания</name>
  <resources>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НаименованиеДокументаЭтапа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТрудозатратыПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ЦБР_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DocumentRef.ЦБР_Задание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <comment>Пользователь, которому показывается уведомление</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Основание</name>
    <comment>Причина возникновения записи в РС</comment>
    <type>
      <types>EnumRef.ЦБР_ПричиныВнимания</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Рабочая.Задачи2/src/InformationRegisters/ЦБР_СостоянияЗаданий/ЦБР_СостоянияЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦБР_СостоянияЗаданий</name>
  <resources>
    <name>ТрудозатратыПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.ЦБР_Состояние</types>
    </type>
  </resources>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DocumentRef.ЦБР_Задание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПользовательАРМ</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Рабочая.Задачи2/src/Enums/ЦБР_ПричиныВнимания/ЦБР_ПричиныВнимания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_ПричиныВнимания</name>
  <enumValues>
    <name>ЗапросИнформации</name>
  </enumValues>
  <enumValues>
    <name>ЭтоНоваяЗадача</name>
  </enumValues>
  <enumValues>
    <name>НетЗапланированныхДействий</name>
  </enumValues>
  <enumValues>
    <name>ЗадачаВЗапросеИнформации</name>
  </enumValues>
  <enumValues>
    <name>ЭтоБлок</name>
  </enumValues>
  <enumValues>
    <name>ПросроченСтартОС</name>
  </enumValues>
  <enumValues>
    <name>ПросроченоОкончаниеОС</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Enums/ЦБР_Состояние/ЦБР_Состояние.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_Состояние</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ГотовКСдаче</name>
  </enumValues>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>ЗапросИнформации</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>НаТестировании</name>
  </enumValues>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>ПринятьЗадачу</name>
  </enumValues>
  <enumValues>
    <name>Приостановлен</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>УточнениеТребований</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Enums/ЦБР_РольВЗадаче/ЦБР_РольВЗадаче.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_РольВЗадаче</name>
  <enumValues>
    <name>Постановщик</name>
  </enumValues>
  <enumValues>
    <name>Наблюдатель</name>
  </enumValues>
  <enumValues>
    <name>Исполнитель</name>
  </enumValues>
  <enumValues>
    <name>КураторИсполнителя</name>
  </enumValues>
  <enumValues>
    <name>КураторПостановщика</name>
  </enumValues>
  <enumValues>
    <name>ВладелецЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительРазработчик</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительАналитик</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Enums/ЦБР_СтатусЗаписиКалендаря/ЦБР_СтатусЗаписиКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_СтатусЗаписиКалендаря</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Начал</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Documents/ЦБР_Задание/ЦБР_Задание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЦБР_Задание</name>
  <registerRecords>AccumulationRegister.ЦБР_ЧасыКлиентов</registerRecords>
  <registerRecords>AccumulationRegister.ЦБР_СогласованоЗакрытоЧасов</registerRecords>
  <registerRecords>AccumulationRegister.ЦБР_КоличествоЧасовСотрудниковПоЗадачам</registerRecords>
  <attributes>
    <name>Аналитик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЧаса</name>
    <type>
      <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалоПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалоФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончаниеПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончаниеФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьДниПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьДниФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПереписка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПрикрепленныйФайл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаСчетКомпании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоментарийКСогласованию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьСроки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НетГарантииОценки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаданияВУровне</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДополнительное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаПоФакту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущееЗадание</name>
    <type>
      <types>DocumentRef.ЦБР_Задание</types>
    </type>
  </attributes>
  <attributes>
    <name>Принято</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Разделена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РамочнаяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.ЦБР_СтруктураЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаЗадачу</name>
    <type>
      <types>CatalogRef.ЦБР_Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаСтруктуру</name>
    <type>
      <types>CatalogRef.ЦБР_СтруктураЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОценкиЗадачи</name>
    <type>
      <types>EnumRef.ЦБР_ТипОценкиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалосьРешитьПриПодключении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасыСогласованы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоУточнениеТребований</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланСтарый</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Предшественники</name>
    <attributes>
      <name>Предшественник</name>
      <type>
        <types>DocumentRef.ЦБР_Задание</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗависимости</name>
      <type>
        <types>EnumRef.ЦБР_ТипЗависимостиЗаданий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭффективныеЧасы</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЧаса</name>
      <type>
        <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭффективныеЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействиеКалендаря</name>
      <type>
        <types>CatalogRef.ЦБР_ЗаписиРабочегоКалендаря</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧасыЗП</name>
    <attributes>
      <name>ПериодЗП</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭффективныеЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЧаса</name>
      <type>
        <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.cbr_РеализацияТоваровУслугУПР</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаСчетКомпании</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Зачтено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Рабочая.Задачи2/src/CommonModules/ЦБР_ТребуетВниманияПолныеПрава/Module.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ЦБР_ЗаписьКалендаряТребуетВнимание(Источник, Отказ) Экспорт 
	ПроверкаЗаписейКалендаря();	
КонецПроцедуры
	
Процедура ЦБР_ЗаписьОбъектаТребуетВнимание(Источник, Отказ) Экспорт
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.ЦБР_Задача") Тогда
		ЗадачаСсылка 	= Источник.Ссылка;  
		ЗаданиеСсылка   = Документы.ЦБР_Задание.ПустаяСсылка();  
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.ЦБР_Задача") Тогда
		ЗадачаСсылка 	= Источник;  
		ЗаданиеСсылка   = Документы.ЦБР_Задание.ПустаяСсылка();  
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.ЦБР_СтруктураЗадач") Тогда
		ЗадачаСсылка 	= Источник.Владелец;  
		ЗаданиеСсылка   = Источник.СсылкаНаЗадание;	
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.ЦБР_ЗаписиРабочегоКалендаря") Тогда
		ЗадачаСсылка 	= Источник.ЗадачаСсылка;  
		ЗаданиеСсылка   = Источник.ЗаданиеСсылка;	
	Иначе
		ЗадачаСсылка 	= Источник.СсылкаНаЗадачу;  
		ЗаданиеССылка   = Источник.Ссылка;
	КонецЕсли;     
	
	СостояниеЗадачи = ЦБР_СтатусыОбъектовПолныеПрава.ПолучитьАктуальныйСтатусЗадачиПользователя(ЗадачаСсылка, Пользователи.АвторизованныйПользователь());

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦБР_ТребуютВнимания.Задача КАК Задача,
	|	ЦБР_ТребуютВнимания.Задание КАК Задание,
	|	ЦБР_ТребуютВнимания.Ответственный КАК Ответственный,
	|	ЦБР_ТребуютВнимания.Основание КАК Основание,
	|	ЦБР_ТребуютВнимания.ДатаДобавления КАК ДатаДобавления,
	|	ЦБР_ТребуютВнимания.НаименованиеДокументаЭтапа КАК НаименованиеДокументаЭтапа,
	|	ЦБР_ТребуютВнимания.ТрудозатратыПлан КАК ТрудозатратыПлан
	|ИЗ
	|	РегистрСведений.ЦБР_ТребуютВнимания КАК ЦБР_ТребуютВнимания
	|ГДЕ
	|	ЦБР_ТребуютВнимания.Задача = &СсылкаНаЗадачу";
	Запрос.УстановитьПараметр("СсылкаНаЗадачу", ЗадачаСсылка);	
	
	Если Запрос.Выполнить().Пустой() Тогда
		СписокТребуетВнимания_Старый = Новый ТаблицаЗначений;    
		СписокТребуетВнимания_Старый.Колонки.Добавить("Задача", 					Новый ОписаниеТипов("СправочникСсылка.ЦБР_Задача"));
		СписокТребуетВнимания_Старый.Колонки.Добавить("Задание", 					Новый ОписаниеТипов("ДокументСсылка.ЦБР_Задание"));
		СписокТребуетВнимания_Старый.Колонки.Добавить("Ответственный", 				Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
		СписокТребуетВнимания_Старый.Колонки.Добавить("Основание", 					Новый ОписаниеТипов("ПеречислениеСсылка.ЦБР_ПричиныВнимания"));
		СписокТребуетВнимания_Старый.Колонки.Добавить("ДатаДобавления", 			Новый ОписаниеТипов("Дата"));
		СписокТребуетВнимания_Старый.Колонки.Добавить("НаименованиеДокументаЭтапа", Новый ОписаниеТипов("Строка")); 
		СписокТребуетВнимания_Старый.Колонки.Добавить("ТрудозатратыПлан", 			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой)));
	Иначе
		СписокТребуетВнимания_Старый = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	СписокТребуетВнимания = СписокТребуетВнимания_Старый.Скопировать();
	СписокТребуетВнимания.Очистить();

#Область ОчисткаРС
	НаборЗаписей = РегистрыСведений.ЦБР_ТребуютВнимания.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Задача.Установить(ЗадачаСсылка);	 

	МассивОснований = Новый Массив;
	МассивОснований.Добавить(Перечисления.ЦБР_ПричиныВнимания.ЭтоНоваяЗадача); 
	МассивОснований.Добавить(Перечисления.ЦБР_ПричиныВнимания.НетЗапланированныхДействий);

	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЦБР_Задание") Тогда    
		НаборЗаписей.Отбор.Задание.Установить(Источник.Ссылка);			
	КонецЕсли;  
	
	Для Каждого Строка ИЗ МассивОснований Цикл 
		НаборЗаписей.Отбор.Основание.Установить(Строка);	
		НаборЗаписей.Записать();
	КонецЦикла;
#КонецОбласти

	Если СостояниеЗадачи = Перечисления.ЦБР_Состояние.Черновик  И 
		НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗадачаСсылка, "ВзялиВРаботу") Тогда
		Возврат;
	КонецЕсли;	
	
	
	// 1. Добавим Исполнителей, у которых есть этапы на этапах черновик и оценка не согласована
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦБР_Задание.Исполнитель КАК Ответственный
	|ИЗ
	|	РегистрСведений.ЦБР_СостоянияЗаданий КАК ЦБР_СостоянияЗаданий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЦБР_Задание КАК ЦБР_Задание
	|		ПО ЦБР_СостоянияЗаданий.Задание = ЦБР_Задание.Ссылка
	|			И ЦБР_СостоянияЗаданий.ПользовательАРМ = ЦБР_Задание.Исполнитель
	|ГДЕ
	|	ЦБР_СостоянияЗаданий.Состояние В(&МассивСостоянийЭтаповЗадачи)
	|	И ЦБР_Задание.СсылкаНаЗадачу = &СсылкаНаЗадачу
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦБР_Задание.Исполнитель";
	
	Запрос.УстановитьПараметр("СсылкаНаЗадачу", ЗадачаСсылка);
	
	МассивСостоянийЭтаповЗадачи = Новый Массив;
	МассивСостоянийЭтаповЗадачи.Добавить(Перечисления.ЦБР_Состояние.Черновик);
	МассивСостоянийЭтаповЗадачи.Добавить(Перечисления.ЦБР_Состояние.НеСогласован);
	Запрос.УстановитьПараметр("МассивСостоянийЭтаповЗадачи", МассивСостоянийЭтаповЗадачи);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаОтветственных = РезультатЗапроса.Выгрузить(); 
	Если ТаблицаОтветственных.Количество() > 0 Тогда
		СписокТребуетВнимания = ДобавитьТребуетВниманиеВОбщийСписок(ЗадачаСсылка, ЗаданиеССылка, ТаблицаОтветственных, 
						Перечисления.ЦБР_ПричиныВнимания.ЭтоНоваяЗадача, ТекущаяДатаСеанса(), СписокТребуетВнимания);
	КонецЕсли; 
	
	// 2. Добавим Исполнителей, которые в Задаче, но у них нет этапов	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦБР_ЗадачаКоманда.Исполнитель КАК Ответственный,
	|	ЦБР_Задание.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЦБР_Задача.Команда КАК ЦБР_ЗадачаКоманда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЦБР_Задание КАК ЦБР_Задание
	|		ПО ЦБР_ЗадачаКоманда.Исполнитель = ЦБР_Задание.Исполнитель
	|ГДЕ
	|	ЦБР_ЗадачаКоманда.Ссылка = &Ссылка
	|	И ЦБР_ЗадачаКоманда.Роль В(&МассивРолей)
	|	И ЦБР_Задание.Ссылка ЕСТЬ NULL";
	
	МассивРолей = Новый Массив; 
	МассивРолей.Добавить(Перечисления.ЦБР_РольВЗадаче.Исполнитель);
	МассивРолей.Добавить(Перечисления.ЦБР_РольВЗадаче.ИсполнительРазработчик);
	МассивРолей.Добавить(Перечисления.ЦБР_РольВЗадаче.ИсполнительАналитик);
	
	Запрос.УстановитьПараметр("МассивРолей", МассивРолей);
	Запрос.УстановитьПараметр("Ссылка", ЗадачаСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаОтветственных = РезультатЗапроса.Выгрузить();
	Если ТаблицаОтветственных.Количество() > 0 Тогда
		СписокТребуетВнимания = ДобавитьТребуетВниманиеВОбщийСписок(ЗадачаСсылка, ЗаданиеССылка, ТаблицаОтветственных, 
						Перечисления.ЦБР_ПричиныВнимания.ЭтоНоваяЗадача, ТекущаяДатаСеанса(), СписокТребуетВнимания);
	КонецЕсли; 
	
	//3. Добавим Руководителей Исполнителей, если на 1,2 этапах никого нет
	Если СписокТребуетВнимания.Количество() = 0 Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦБР_СтруктураЗадач.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЦБР_СтруктураЗадач КАК ЦБР_СтруктураЗадач
		|ГДЕ
		|	ЦБР_СтруктураЗадач.Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец", ЗадачаСсылка);
		
		Если Запрос.Выполнить().Пустой() Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЦБР_ЗадачаКоманда.Исполнитель КАК Ответственный
			|ИЗ
			|	Справочник.ЦБР_Задача.Команда КАК ЦБР_ЗадачаКоманда
			|ГДЕ
			|	ЦБР_ЗадачаКоманда.Ссылка = &Ссылка
			|	И ЦБР_ЗадачаКоманда.Роль В (&МассивРолей)
			|
			|СГРУППИРОВАТЬ ПО
			|	ЦБР_ЗадачаКоманда.Исполнитель";
			
			МассивРолей = Новый Массив; 
			МассивРолей.Добавить(Перечисления.ЦБР_РольВЗадаче.КураторИсполнителя);
			МассивРолей.Добавить(Перечисления.ЦБР_РольВЗадаче.ВладелецЗадачи);
			
			Запрос.УстановитьПараметр("МассивРолей", МассивРолей);
			Запрос.УстановитьПараметр("Ссылка", ЗадачаСсылка);
			
			ТаблицаОтветственных = Запрос.Выполнить().Выгрузить(); 
			СписокТребуетВнимания = ДобавитьТребуетВниманиеВОбщийСписок(ЗадачаСсылка, ЗаданиеССылка, ТаблицаОтветственных, 
			Перечисления.ЦБР_ПричиныВнимания.ЭтоНоваяЗадача, ТекущаяДатаСеанса(), СписокТребуетВнимания);
			
		КонецЕсли; 	
	КонецЕсли; 	
	
	// 4. Пройдемся по Заданиям без ОС или просроченным
	МассивСостояний = Новый Массив;
	МассивСостояний.Добавить(Перечисления.ЦБР_Состояние.ВРаботе);
	//МассивСостояний.Добавить(Перечисления.ЦБР_Состояние.Запланировано);
	МассивСостояний.Добавить(Перечисления.ЦБР_Состояние.Согласован);
	МассивСостояний.Добавить(Перечисления.ЦБР_Состояние.Новый);
	//МассивСостояний.Добавить(Перечисления.ЦБР_Состояние.ОценкаНеСогласована);     
	//МассивСостояний.Добавить(Перечисления.ЦБР_Состояние.ОценкаСогласована);
	//МассивСостояний.Добавить(Перечисления.ЦБР_Состояние.Приостановлен);

	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.ЦБР_СтатусЗаписиКалендаря.Новый);
	МассивСтатусов.Добавить(Перечисления.ЦБР_СтатусЗаписиКалендаря.Начал);

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦБР_ЗаписиРабочегоКалендаря.ЗаданиеСсылка КАК СобытиеЗаданиеСсылка
	               |ПОМЕСТИТЬ ВТ_ЗаданияСОС
	               |ИЗ
	               |	Справочник.ЦБР_ЗаписиРабочегоКалендаря КАК ЦБР_ЗаписиРабочегоКалендаря
	               |ГДЕ
	               |	ЦБР_ЗаписиРабочегоКалендаря.Статус В(&Статус)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЦБР_ЗаписиРабочегоКалендаря.ЗаданиеСсылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЦБР_Задание.Исполнитель КАК Ответственный
	               |ИЗ
	               |	Документ.ЦБР_Задание КАК ЦБР_Задание
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦБР_СостоянияЗаданий КАК ЦБР_СостоянияЗаданий
	               |		ПО ЦБР_Задание.Ссылка = ЦБР_СостоянияЗаданий.Задание
	               |ГДЕ
	               |	ЦБР_Задание.СсылкаНаЗадачу = &Задача
	               |	И НЕ ЦБР_Задание.Ссылка В
	               |				(ВЫБРАТЬ
	               |					ВТ_ЗаданияСОС.СобытиеЗаданиеСсылка
	               |				ИЗ
	               |					ВТ_ЗаданияСОС КАК ВТ_ЗаданияСОС)
	               |	И ЦБР_СостоянияЗаданий.Состояние В(&МассивСостояний)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЦБР_Задание.Исполнитель";
	
	
	Запрос.УстановитьПараметр("Задача", ЗадачаСсылка);
	Запрос.УстановитьПараметр("МассивСостояний", МассивСостояний);
	Запрос.УстановитьПараметр("Статус", МассивСтатусов);
	
	ТаблицаОтветственных = Запрос.Выполнить().Выгрузить(); 
	СписокТребуетВнимания = ДобавитьТребуетВниманиеВОбщийСписок(ЗадачаСсылка, ЗаданиеССылка, ТаблицаОтветственных, 
	Перечисления.ЦБР_ПричиныВнимания.НетЗапланированныхДействий, ТекущаяДатаСеанса(), СписокТребуетВнимания);
					
	//Почистим старые записи, по которым нет необходимости напоминать
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокТребуетВнимания.Ответственный КАК Ответственный,
	|	СписокТребуетВнимания.Основание КАК Основание
	|ПОМЕСТИТЬ вт_Список
	|ИЗ
	|	&СписокТребуетВнимания КАК СписокТребуетВнимания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокТребуетВнимания_Старый.Ответственный КАК Ответственный,
	|	СписокТребуетВнимания_Старый.Основание КАК Основание
	|ПОМЕСТИТЬ вт_Старый
	|ИЗ
	|	&СписокТребуетВнимания_Старый КАК СписокТребуетВнимания_Старый
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Старый.Ответственный КАК Ответственный,
	|	вт_Старый.Основание КАК Основание
	|ИЗ
	|	вт_Старый КАК вт_Старый
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Список КАК вт_Список
	|		ПО вт_Старый.Ответственный = вт_Список.Ответственный
	|			И вт_Старый.Основание = вт_Список.Основание
	|ГДЕ
	|	вт_Список.Ответственный ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("СписокТребуетВнимания", 			СписокТребуетВнимания); 
	Запрос.УстановитьПараметр("СписокТребуетВнимания_Старый", 	СписокТребуетВнимания_Старый); 
	СписокТребуетВниманияУдалить = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокТребуетВнимания.Ответственный КАК Ответственный,
	|	СписокТребуетВнимания.Основание КАК Основание,
	|	СписокТребуетВнимания.ДатаДобавления КАК ДатаДобавления
	|ПОМЕСТИТЬ вт_список
	|ИЗ
	|	&СписокТребуетВнимания КАК СписокТребуетВнимания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Старый.Ответственный КАК Ответственный,
	|	Старый.Основание КАК Основание,
	|	Старый.ДатаДобавления КАК ДатаДобавления
	|ПОМЕСТИТЬ вт_старый
	|ИЗ
	|	&СписокТребуетВнимания_Старый КАК Старый
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_список.Ответственный КАК Ответственный,
	|	вт_список.Основание КАК Основание,
	|	вт_список.ДатаДобавления КАК ДатаДобавления
	|ПОМЕСТИТЬ вт_общая
	|ИЗ
	|	вт_список КАК вт_список
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт_старый.Ответственный,
	|	вт_старый.Основание,
	|	вт_старый.ДатаДобавления
	|ИЗ
	|	вт_старый КАК вт_старый
	|ГДЕ
	|	НЕ вт_старый.Ответственный В (&СписокДляУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_общая.Ответственный КАК Ответственный,
	|	вт_общая.Основание КАК Основание,
	|	МИНИМУМ(вт_общая.ДатаДобавления) КАК ДатаДобавления
	|ИЗ
	|	вт_общая КАК вт_общая
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_общая.Ответственный,
	|	вт_общая.Основание";
	Запрос.УстановитьПараметр("СписокТребуетВнимания_Старый", 	СписокТребуетВнимания_Старый);
	Запрос.УстановитьПараметр("СписокТребуетВнимания", 			СписокТребуетВнимания);
	Запрос.УстановитьПараметр("СписокДляУдаления", 				СписокТребуетВниманияУдалить);
	
	//Общий список Требует внимание записываем в РС
	ДобавитьЗаписиВРС_ТребуетВнимание(Запрос.Выполнить().Выгрузить(), ЗадачаСсылка, ЗаданиеСсылка); 
	
КонецПроцедуры

Процедура ПроверкаЗаписейКалендаря() Экспорт   
	
	
	#Область ОчисткаРС
	НаборЗаписей = РегистрыСведений.ЦБР_ТребуютВнимания.СоздатьНаборЗаписей();
	
	МассивОснований = Новый Массив;
	МассивОснований.Добавить(Перечисления.ЦБР_ПричиныВнимания.ПросроченоОкончаниеОС); 
	МассивОснований.Добавить(Перечисления.ЦБР_ПричиныВнимания.ПросроченСтартОС);
	
	Для Каждого Строка ИЗ МассивОснований Цикл 
		НаборЗаписей.Отбор.Основание.Установить(Строка);	
		НаборЗаписей.Записать();
	КонецЦикла;
	#КонецОбласти     

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦБР_ЗаписиРабочегоКалендаря.Ссылка КАК Событие,
		|	ЦБР_ЗаписиРабочегоКалендаря.Пользователь КАК Ответственный,
		|	ЦБР_ЗаписиРабочегоКалендаря.ЗадачаСсылка КАК ЗадачаСсылка,
		|	ЦБР_ЗаписиРабочегоКалендаря.ЗаданиеСсылка КАК ЗаданиеСсылка,
		|	ЦБР_ЗаписиРабочегоКалендаря.ДатаОкончания КАК ДатаДобавления,
		|	ЦБР_ЗаписиРабочегоКалендаря.Статус КАК Статус
		|ИЗ
		|	Справочник.ЦБР_ЗаписиРабочегоКалендаря КАК ЦБР_ЗаписиРабочегоКалендаря
		|ГДЕ
		|	ЦБР_ЗаписиРабочегоКалендаря.Статус = &СтатусНовый
		|	И ЦБР_ЗаписиРабочегоКалендаря.ДатаНачала < &ДатаСобытия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЦБР_ЗаписиРабочегоКалендаря.Ссылка,
		|	ЦБР_ЗаписиРабочегоКалендаря.Пользователь,
		|	ЦБР_ЗаписиРабочегоКалендаря.ЗадачаСсылка,
		|	ЦБР_ЗаписиРабочегоКалендаря.ЗаданиеСсылка,
		|	ЦБР_ЗаписиРабочегоКалендаря.ДатаОкончания,
		|	ЦБР_ЗаписиРабочегоКалендаря.Статус
		|ИЗ
		|	Справочник.ЦБР_ЗаписиРабочегоКалендаря КАК ЦБР_ЗаписиРабочегоКалендаря
		|ГДЕ
		|	ЦБР_ЗаписиРабочегоКалендаря.Статус = &СтатусНачал
		|	И ЦБР_ЗаписиРабочегоКалендаря.ДатаОкончания < &ДатаСобытия";
	
	Запрос.УстановитьПараметр("ДатаСобытия", ТекущаяДатаСеанса());
	
	//МассивСтатусов = Новый Массив;
	//МассивСтатусов.Добавить(Перечисления.ЦБР_СтатусЗаписиКалендаря.Новый);
	//МассивСтатусов.Добавить(Перечисления.ЦБР_СтатусЗаписиКалендаря.Начал);
	//Запрос.УстановитьПараметр("Статус", МассивСтатусов);
	Запрос.УстановитьПараметр("СтатусНовый", Перечисления.ЦБР_СтатусЗаписиКалендаря.Новый);
	Запрос.УстановитьПараметр("СтатусНачал", Перечисления.ЦБР_СтатусЗаписиКалендаря.Начал);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
			ЗадачаСсылка = ВыборкаДетальныеЗаписи.ЗадачаСсылка; 
			ЗаданиеСсылка = ВыборкаДетальныеЗаписи.ЗаданиеСсылка; 
			НаборЗаписей = РегистрыСведений.ЦБР_ТребуютВнимания.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.Задача.Установить(ЗадачаСсылка);
			НаборЗаписей.Отбор.Задание.Установить(ЗаданиеСсылка);
			
			ОбъемЧасов = ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьСуммуОценокПоЗадаче(ЗадачаСсылка);
			НоваяЗапись = НаборЗаписей.Добавить(); 
			НоваяЗапись.Задача				= ЗадачаСсылка;         
			НоваяЗапись.Задание				= ЗаданиеСсылка; 
			НоваяЗапись.Ответственный 		= ВыборкаДетальныеЗаписи.Ответственный; 
			Если ВыборкаДетальныеЗаписи.Статус = Перечисления.ЦБР_СтатусЗаписиКалендаря.Начал Тогда
				НоваяЗапись.Основание 			= Перечисления.ЦБР_ПричиныВнимания.ПросроченоОкончаниеОС;
			Иначе
				НоваяЗапись.Основание 			= Перечисления.ЦБР_ПричиныВнимания.ПросроченСтартОС;
			КонецЕсли;
			НоваяЗапись.ДатаДобавления 		= ВыборкаДетальныеЗаписи.ДатаДобавления; 
			НоваяЗапись.ТрудозатратыПлан 	= ОбъемЧасов;
			НаборЗаписей.Записать();   
		КонецЦикла;    
	КонецЕсли; 
	
КонецПроцедуры

Функция ДобавитьТребуетВниманиеВОбщийСписок(ЗадачаСсылка, ЗаданиеСсылка, ТаблицаОтветственных, ПричинаВнимания, ДатаДобавления, СписокТребуетВнимания)
	
	Для Каждого СтрокаТаблицы Из ТаблицаОтветственных Цикл 
		НС = СписокТребуетВнимания.Добавить();
		НС.Ответственный 	= СтрокаТаблицы.Ответственный;
		НС.Задача          	= ЗадачаСсылка;
		НС.Задание          = ЗаданиеСсылка;
		НС.Основание 		= ПричинаВнимания; 
		НС.ДатаДобавления 	= ДатаДобавления; 	
	КонецЦикла; 
	
	Возврат СписокТребуетВнимания;
КонецФункции

Процедура ДобавитьЗаписиВРС_ТребуетВнимание(СписокТребуетВнимания, ЗадачаСсылка, ЗаданиеСсылка)  
	
	//Если СписокТребуетВнимания.Количество() > 0 Тогда
		ОбъемЧасов = ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьСуммуОценокПоЗадаче(ЗадачаСсылка);
		
		НаборЗаписей = РегистрыСведений.ЦБР_ТребуютВнимания.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Задача.Установить(ЗадачаСсылка); 
		Для Каждого СтрокаТаблицы Из СписокТребуетВнимания Цикл 
			НоваяЗапись = НаборЗаписей.Добавить(); 
			НоваяЗапись.Задача				= ЗадачаСсылка;
			НоваяЗапись.Задание				= ЗаданиеСсылка;
			НоваяЗапись.Ответственный 		= СтрокаТаблицы.Ответственный; 
			НоваяЗапись.Основание 			= СтрокаТаблицы.Основание; 
			НоваяЗапись.ДатаДобавления 		= СтрокаТаблицы.ДатаДобавления; 
			НоваяЗапись.ТрудозатратыПлан 	= ОбъемЧасов; 
		КонецЦикла; 
		НаборЗаписей.Записать(); 
	//КонецЕсли;

КонецПроцедуры

Функция ПолучитьКоличествоЗапланированныхДействийИсполнителя(Исполнитель, ЗаданиеССылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦБР_ЗаписиРабочегоКалендаря.Ссылка КАК Ссылка,
	|	ЦБР_ЗаписиРабочегоКалендаря.Пользователь КАК Пользователь
	|ИЗ
	|	Справочник.ЦБР_ЗаписиРабочегоКалендаря КАК ЦБР_ЗаписиРабочегоКалендаря
	|ГДЕ
	|	ЦБР_ЗаписиРабочегоКалендаря.ЗаданиеСсылка = &ЗаданиеСсылка
	|	И ЦБР_ЗаписиРабочегоКалендаря.Статус В (&Статус)
	|	И НЕ ЦБР_ЗаписиРабочегоКалендаря.ПометкаУдаления";

	Запрос.УстановитьПараметр("Пользователь", Исполнитель);
	Запрос.УстановитьПараметр("ЗаданиеСсылка", ЗаданиеСсылка); 
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.ЦБР_СтатусЗаписиКалендаря.Новый);
	МассивСтатусов.Добавить(Перечисления.ЦБР_СтатусЗаписиКалендаря.Начал);
	Запрос.УстановитьПараметр("Статус", МассивСтатусов);  

	Возврат Запрос.Выполнить().Выбрать().Количество();
	
КонецФункции

#КонецОбласти
